# Import Libraries

In [33]:
import numpy as np
import pandas as pd

# Orders Data Extraction

In [34]:
orders = pd.read_csv("orders.csv")
orders

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item
0,2714054,469662,21386,2015-10-15 08:50:56.000,597982.0,محمود آباد,1.0
1,11104039,3063877,248497,2018-02-11 00:29:26.000,980000.0,خرمدره,1.0
2,4228130,3184893,50144,2016-06-14 00:30:08.000,229358.0,قرچک,1.0
3,22225624,6888562,70208,2018-09-03 14:37:19.000,16514.0,قم,1.0
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028.0,تهران,1.0
...,...,...,...,...,...,...,...
199995,12172771,4403268,445940,2018-04-03 12:07:01.000,344037.0,تهران,2.0
199996,4425393,3745774,131645,2016-07-09 19:14:09.000,600000.0,محمدیه,1.0
199997,6671889,4845514,215045,2017-03-08 23:47:06.000,450000.0,اصفهان,1.0
199998,6315995,2541418,264021,2017-02-08 14:59:39.000,193486.0,همدان,1.0
199999,7584127,1342585,89427,2017-06-17 10:08:06.000,55046.0,بندر انزلی,1.0

In [35]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID_Order               200000 non-null  int64
 1   ID_Customer            200000 non-null  int64
 2   ID_Item                200000 non-null  int64
 3   DateTime_CartFinalize  200000 non-null  object
 4   Amount_Gross_Order     200000 non-null  float64
 5   city_name_fa           200000 non-null  object
 6   Quantity_item          200000 non-null  float64
dtypes: float64(2), int64(3), object(2)
memory usage: 10.7+ MB

In [36]:
orders.describe()

,ID_Order,ID_Customer,ID_Item,Amount_Gross_Order,Quantity_item
count,2.000000e+05,2.000000e+05,2.000000e+05,2.000000e+05,200000.000000
mean,9.871963e+06,2.860671e+06,3.757313e+05,1.458204e+06,1.261225
std,6.404275e+06,1.921815e+06,3.948462e+05,5.450972e+06,1.801186
min,1.000411e+06,4.661320e+05,7.600000e+01,0.000000e+00,1.000000
25%,5.022253e+06,1.021053e+06,8.955725e+04,1.212730e+05,1.000000
50%,8.591270e+06,2.895180e+06,2.302210e+05,3.211010e+05,1.000000
75%,1.246037e+07,4.179218e+06,5.192668e+05,1.011032e+06,1.000000
max,2.484656e+07,7.282118e+06,2.093722e+06,1.530000e+09,500.000000

In [37]:
orders.isna().sum()

ID_Order                 0
ID_Customer              0
ID_Item                  0
DateTime_CartFinalize    0
Amount_Gross_Order       0
city_name_fa             0
Quantity_item            0
dtype: int64

## DataFrame Correction

In [38]:
# تبدیل ستون‌های مورد نیاز به نوع داده صحیح

orders['Amount_Gross_Order'] = pd.to_numeric(orders['Amount_Gross_Order'], errors='coerce').astype(np.int64)

orders['Quantity_item'] = pd.to_numeric(orders['Quantity_item'], errors='coerce').astype(np.int64)

In [39]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID_Order               200000 non-null  int64
 1   ID_Customer            200000 non-null  int64
 2   ID_Item                200000 non-null  int64
 3   DateTime_CartFinalize  200000 non-null  object
 4   Amount_Gross_Order     200000 non-null  int64
 5   city_name_fa           200000 non-null  object
 6   Quantity_item          200000 non-null  int64
dtypes: int64(5), object(2)
memory usage: 10.7+ MB

## Adding Total_Sales_Value

In [40]:
orders['Total_Sales_Value'] = orders['Amount_Gross_Order'] * orders['Quantity_item']
orders

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,Total_Sales_Value
0,2714054,469662,21386,2015-10-15 08:50:56.000,597982,محمود آباد,1,597982
1,11104039,3063877,248497,2018-02-11 00:29:26.000,980000,خرمدره,1,980000
2,4228130,3184893,50144,2016-06-14 00:30:08.000,229358,قرچک,1,229358
3,22225624,6888562,70208,2018-09-03 14:37:19.000,16514,قم,1,16514
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028,تهران,1,133028
...,...,...,...,...,...,...,...,...
199995,12172771,4403268,445940,2018-04-03 12:07:01.000,344037,تهران,2,688074
199996,4425393,3745774,131645,2016-07-09 19:14:09.000,600000,محمدیه,1,600000
199997,6671889,4845514,215045,2017-03-08 23:47:06.000,450000,اصفهان,1,450000
199998,6315995,2541418,264021,2017-02-08 14:59:39.000,193486,همدان,1,193486
199999,7584127,1342585,89427,2017-06-17 10:08:06.000,55046,بندر انزلی,1,55046

# Five Cities with the most orders

## بدون در نظر گرفتن Amount_Gross_Order

In [41]:
# orders.columns
top_five_cities_raw = orders['city_name_fa'].value_counts().head(5)
top_five_cities_raw

city_name_fa
تهران     108306
مشهد        6024
اصفهان      5992
کرج         5934
اهواز       4313
Name: count, dtype: int64

## با در نظر گرفتن Amount_Gross_Order

In [42]:
city_sales = orders.groupby('city_name_fa')['Amount_Gross_Order'].sum().sort_values(ascending=False)

top_five_cities = city_sales.head(5)

print("--- نتایج تحلیل فروش بر اساس شهر (کل داده‌ها) ---")
top_five_cities

--- نتایج تحلیل فروش بر اساس شهر (کل داده‌ها) ---

city_name_fa
تهران     152743141946
اصفهان      9459528103
کرج         8992794977
مشهد        8714945130
شیراز       6093235024
Name: Amount_Gross_Order, dtype: int64

## کالا هایی که در این 5 شهر بیشترین فروش را داشتند.

##  استخراج داده‌های 5 شهر برتر برای تحلیل

In [43]:
top_5_city_names = top_five_cities.index.tolist()
orders_top_5 = orders[orders['city_name_fa'].isin(top_5_city_names)]
orders_top_5.value_counts()

orders_top_5.to_csv("top_five_cities_orders.csv", index=False)
orders_top_5

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,Total_Sales_Value
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028,تهران,1,133028
5,11479246,2841640,312932,2018-03-01 12:07:15.000,290000,مشهد,1,290000
6,8267421,5235886,42365,2017-08-19 13:30:24.000,55046,اصفهان,1,55046
8,9916301,1145709,102588,2017-12-11 19:33:59.000,34862,تهران,1,34862
10,4605740,637880,138296,2016-08-02 10:48:18.000,469358,تهران,1,469358
...,...,...,...,...,...,...,...,...
199989,8320537,659553,192749,2017-08-24 11:38:29.000,37798,تهران,24,907152
199991,23311624,4293370,1193629,2018-10-15 18:03:08.000,370000,تهران,1,370000
199994,4228418,3720408,123312,2016-06-14 05:05:39.000,120000,تهران,1,120000
199995,12172771,4403268,445940,2018-04-03 12:07:01.000,344037,تهران,2,688074
199997,6671889,4845514,215045,2017-03-08 23:47:06.000,450000,اصفهان,1,450000

### بیشترین کالا های فروخته شده از نظر تعداد و ارزش در 5 شهر پرفروش

#### تحلیل پرفروش‌ترین 10 کالاها بر اساس تعداد (Quantity)

In [44]:
top_items_by_quantity = orders_top_5.groupby('ID_Order')['Quantity_item'].sum().sort_values(ascending=False).head(10)
top_items_by_quantity = top_items_by_quantity.astype(np.int64)

top_items_by_quantity = top_items_by_quantity.reset_index()
top_items_by_quantity

   ID_Order  Quantity_item
0  11842273            200
1   5827626            100
2   3008233            100
3   8753075             85
4   6521928             67
5   5487992             60
6   4783386             57
7  22276136             50
8   5951502             48
9   5118424             47

In [45]:
top_items_by_quantity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID_Order       10 non-null     int64
 1   Quantity_item  10 non-null     int64
dtypes: int64(2)
memory usage: 292.0 bytes

#### پرفروش‌ترین 10 آیتم بر اساس ارزش (Value)

In [46]:
top_items_by_value = orders_top_5.groupby('ID_Order')['Amount_Gross_Order'].sum().sort_values(ascending=False).head(10)
top_items_by_value = top_items_by_value.astype(np.int64)

top_items_by_value = top_items_by_value.reset_index()

top_items_by_value

   ID_Order  Amount_Gross_Order
0   8556100          1530000000
1  13137692           166623853
2  23449403           158990000
3  10580826           157699000
4  12447089           136393670
5   8153606           115522936
6  21619597           113000000
7   9881373           111880000
8   6305168           110082569
9  20968962           109900000

In [47]:
top_items_by_value.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID_Order            10 non-null     int64
 1   Amount_Gross_Order  10 non-null     int64
dtypes: int64(2)
memory usage: 292.0 bytes

#### نمایش اطلاعات استخراج شده در جدول

##### برای 10 کالا با بیشترین تعداد فروش

In [48]:
results_top_quantity = pd.merge(
    top_items_by_quantity,
    orders,
    on='ID_Order',
    how='inner'
)
results_top_quantity

,ID_Order,Quantity_item_x,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item_y,Total_Sales_Value
0,11842273,200,1107946,258611,2018-03-11 13:28:05.000,219266,تهران,200,43853200
1,5827626,100,3996961,18965,2016-12-21 18:39:09.000,178899,تهران,100,17889900
2,3008233,100,754054,100064,2015-12-16 14:23:51.000,883623,تهران,100,88362300
3,8753075,85,4984621,437891,2017-09-26 14:56:12.000,1,تهران,85,85
4,6521928,67,1368745,287961,2017-02-26 13:51:57.000,5000,تهران,67,335000
5,5487992,60,3973483,234612,2016-11-17 00:18:49.000,110092,اصفهان,60,6605520
6,4783386,57,1485614,54622,2016-08-20 09:18:43.000,2577981,تهران,57,146944917
7,22276136,50,689468,1152805,2018-09-05 00:14:59.000,71560,اصفهان,20,1431200
8,22276136,50,689468,1150890,2018-09-05 00:14:59.000,35780,اصفهان,30,1073400
9,5951502,48,2859180,227349,2017-01-02 11:15:54.000,50459,تهران,48,2422032
10,5118424,47,4087705,26161,2016-10-01 11:43:10.000,138440,مشهد,47,6506680

##### برای 10 کالا با بیشترین ارزش

In [49]:
results_top_value = pd.merge(
    top_items_by_value,
    orders,
    on='ID_Order',
    how='inner'
)
results_top_value

,ID_Order,Amount_Gross_Order_x,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order_y,city_name_fa,Quantity_item,Total_Sales_Value
0,8556100,1530000000,643657,428330,2017-09-13 14:53:22.000,1530000000,تهران,1,1530000000
1,13137692,166623853,6960541,449189,2018-05-26 10:26:22.000,166623853,تهران,1,166623853
2,23449403,158990000,7131218,975414,2018-10-21 13:40:36.000,158990000,تهران,1,158990000
3,10580826,157699000,1018240,306698,2018-01-13 16:38:46.000,157699000,تهران,1,157699000
4,12447089,136393670,3415472,541305,2018-04-18 13:15:13.000,70990000,تهران,2,141980000
5,12447089,136393670,3415472,512703,2018-04-18 13:15:13.000,65403670,تهران,1,65403670
6,8153606,115522936,3512053,270385,2017-08-08 19:08:14.000,115522936,تهران,1,115522936
7,21619597,113000000,3220117,1351306,2018-08-13 19:59:46.000,113000000,تهران,1,113000000
8,9881373,111880000,5841506,423587,2017-12-09 10:40:28.000,111880000,تهران,1,111880000
9,6305168,110082569,929204,271546,2017-02-07 15:24:16.000,110082569,اصفهان,1,110082569
10,20968962,109900000,2967138,1191474,2018-07-22 15:54:40.000,109900000,تهران,1,109900000

##### کلیه محصولات فروخته شده در این 5 شهر (Sort By : Total_Sales_Value = ًQuantity * Gross_amount)

In [70]:
final_result = pd.merge(
    orders_top_5,
    orders,
    on='ID_Order',
    how='inner'
)
final_result.sort_values(by="Total_Sales_Value_y", ascending=False, inplace=True)
final_result.columns

Index(['ID_Order', 'ID_Customer_x', 'ID_Item_x', 'DateTime_CartFinalize_x',
       'Amount_Gross_Order_x', 'city_name_fa_x', 'Quantity_item_x',
       'Total_Sales_Value_x', 'ID_Customer_y', 'ID_Item_y',
       'DateTime_CartFinalize_y', 'Amount_Gross_Order_y', 'city_name_fa_y',
       'Quantity_item_y', 'Total_Sales_Value_y'],
      dtype='object')

In [77]:
final_result = final_result.iloc[:, :8]
final_result.columns = ['id_order', 'id_customer', 'id_item', 'DateTime', 'city_name' ,'amount_gross', 'quantity', 'total_sales']
final_result.to_csv("Top_Ordered_Items_For_Top_Five_Cities.csv", index=False)
final_result

,id_order,id_customer,id_item,DateTime,city_name,amount_gross,quantity,total_sales
21450,8556100,643657,428330,2017-09-13 14:53:22.000,1530000000,تهران,1,1530000000
126493,1122141,716378,12206,2014-02-19 13:25:00.000,11882452,تهران,30,356473560
82321,9925599,5437450,303009,2017-12-11 23:22:13.000,19990826,تهران,14,279871564
68795,6616927,3656845,241665,2017-03-04 12:52:42.000,26487156,تهران,8,211897248
47973,5908757,838763,242471,2016-12-28 16:12:55.000,35796734,تهران,5,178983670
...,...,...,...,...,...,...,...,...
120341,5220510,2904581,208936,2016-10-16 15:23:23.000,1,تهران,1,1
120326,5179037,1231077,208932,2016-10-09 16:40:44.000,1,تهران,1,1
39054,5500404,3739956,208932,2016-11-18 21:04:40.000,1,تهران,1,1
100445,3482361,3569947,51778,2016-02-22 18:21:47.000,0,تهران,2,0
83860,3931167,3635876,23108,2016-05-01 11:58:30.000,0,تهران,1,0